tutorials/incompressible/simpleDBSFoam/est_subvol/constant/fvOptionsRun
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

momentumSource
{
    type      vectorSemiImplicitSource;

    timeStart       0.0;
    duration        TotalTime;
    selectionMode   all;

    volumeMode      specific;
    injectionRateSuSp
    {
        U    ((PGRAD 0 0) 0);
    }
}


// ************************************************************************* //
