tutorials/incompressible/simpleDBSFoam/est_subvol/system/fvSolution1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-6;
        relTol           0.1;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
	maxIter 20;

    }
    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance        0;
        relTol           0.1;
    }
}

SIMPLE
{
    pRefCell 0;
    pRefValue 0;
    nNonOrthogonalCorrectors 0;

    nS nSmooth;
    cS cSmooth;


    residualControl
    {
       p     1e-6;
       U     1e-6;
    }
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.7;
    }
}


// ************************************************************************* //
